#+STARTUP: overview
* ミュータブル・イミュータブル
#+begin_src python :results output
  # 数値はイミュータブル
  a = [1, 2, 3, 4]
  for v in a:
	  v = 100
  print(a)

  # リストはミュータブル
  b = [[1, 2], [3, 4]]
  for v in b:
	  v[0] = 100
  print(b)
#+end_src

#+RESULTS:
: [1, 2, 3, 4]
: [[100, 2], [100, 4]]

#+begin_src python :results output
  # タプルはイミュータブル
  a = [(1, 2)]
  try:
	  for v in a:
		  v[0] = 1
  except TypeError:
		  print("Tuple is immutable")

  # 文字列はイミュータブル
  b = "Hello"
  try:
		  b[0] = "A"
  except TypeError:
		  print("String is immutable")
#+end_src

#+RESULTS:
: Tuple is immutable
: String is immutable
* ライブラリ
** gensim
- gensimの学習の注意点
   - gensim.Word2Vecの第1引数はlist of listsが想定されている．
	 ⇢ ['春の海', '人間']のように次元が足りないlistをコーパスにすると，Char2Vecのように一文字ずつ学習がされてしまう．

* 雑メモ
** pythonのimportで詰まった <2020-12-27 Sun>
   ファイル名でtokenize.pyなどの汎用的な名前をつけていると，組み込みのものなどと競合してしまう
** pickle ファイルが読み込めない
   - pickle を詠むときは 'rb'
** matplotlib で cairo.Context エラー
  - 環境
	- Python 3.8.10
	- WSL-Ubuntu-20.04
  - 解決策
	- https://qiita.com/5ara5treamer/items/4bf82ada81a3cb30beed
	  - 5 年前の記事だが，最新の pyqt6 が2021年に出たばかりのため基本これで対応できるはず
** 組み込みリストの平坦化
- sum(a, []) で実現できる
  - 組み込み関数 sum の初期値として [] を指定するとリストの +演算になり，結果として平坦化される
  - numpy 配列の場合は flatten() メソッドなどがある
#+begin_src python :results output 
  a = [[1, 2], [3, 4]]
  print(sum(a, []))
#+end_src

#+RESULTS:
: [1, 2, 3, 4]
** 組み込みリストの転置
#+begin_src python :results output 
  a = [[1, 2], [3, 4]]
  a_T = list(map(list, zip(*a)))
  print(a_T)
#+end_src

#+RESULTS:
: [[1, 3], [2, 4]]

** シンボル名の一括変換
   - シンボル名の上でC-c C-eを押すとモードに入る（もう一度押すと抜ける）
   - eglot では，シンボルの上でeglot-rename(C-c e n)でリネームできる
